# TypeBinding Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TypeBinding Constructor
TypeBinding Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TypeBinding()()()() | Constructs an empty type binding. |
| TypeBinding(CategorySet) | Constructs a type binding with the set of categories passed. |

# See Also
TypeBinding Class
TypeBinding Members
Autodesk.Revit.DB Namespace